import { useCartStore } from '@/lib/store/cartStore';

useCartStore.setState({
  items: [
    {
      price: {
        value: 2400,
        currency: 'грн',
      },
      _id: '6877b9f116ae59c7b60d0090',
      name: "Худі 'Urban Hoodie'",
      category: {
        _id: '690c9ce6a6276289c98fc00c',
        name: 'Худі та кофти',
      },
      image: 'https://ftp.goit.study/img/goods/6877b9f116ae59c7b60d0090.webp',
      size: ['XS', 'S', 'M', 'L', 'XL', 'XXL'],
      description:
        "Худі 'Urban Hoodie' — це ваш особистий простір комфорту в динамічному ритмі міста. Створене для тих, хто цінує свободу рухів та лаконічний дизайн. Його вільний крій створює розслаблений силует, а щільна бавовна преміум-якості дарує неперевершене відчуття затишку та тепла. Це універсальна річ, що стане основою вашого повсякденного гардероба. Глибокий капюшон захистить від вітру, а зручна кишеня-кенгуру робить його ідеальним супутником для будь-яких справ.",
      feedbacks: [
        {
          _id: '690ddbe1a6276289c98fd00d',
          author: 'Кирило',
          date: '2025-10-01T00:00:00.000Z',
          description:
            'Худі виглядає дуже стильно. Щільна тканина, преміум якість відчувається. Глибокий капюшон - це топ. Коштує своїх грошей.',
          rate: 4.5,
          productId: '6877b9f116ae59c7b60d0090',
        },
      ],
      prevDescription:
        "Худі 'Urban Hoodie' — ваш простір комфорту в ритмі міста. Створене для цінителів свободи та лаконічного дизайну. Вільний крій створює розслаблений силует, а щільна бавовна преміум-якості дарує затишок. Глибокий капюшон та кишеня-кенгуру. Основа.",
      gender: 'unisex',
      characteristics: [
        'Матеріал: щільна бавовна (преміум-якість)',
        'Крій: вільний',
        'Капюшон: глибокий',
        'Кишеня: кенгуру',
      ],
      quantity: 1,
    },
    {
      price: {
        value: 2100,
        currency: 'грн',
      },
      _id: '6877b9f116ae59c7b60d0091',
      name: "Сорочка 'Flow Linen Shirt'",
      category: {
        _id: '690c9ce6a6276289c98fc006',
        name: 'Футболки та сорочки',
      },
      image: 'https://ftp.goit.study/img/goods/6877b9f116ae59c7b60d0091.webp',
      size: ['XS', 'S', 'M', 'L', 'XL', 'XXL'],
      description:
        "Сорочка 'Flow Linen Shirt' — це ваш особистий простір комфорту в динамічному ритмі міста. Створене для тих, хто цінує свободу рухів та лаконічний дизайн. Його вільний крій створює розслаблений силует, а щільна бавовна преміум-якості дарує неперевершене відчуття затишку та тепла. Це універсальна річ, що стане основою вашого повсякденного гардероба. Глибокий капюшон захистить від вітру, а зручна кишеня-кенгуру робить його ідеальним супутником для будь-яких справ.",
      feedbacks: [],
      prevDescription:
        'Ваш особистий простір комфорту в динамічному ритмі міста. Створене для тих, хто цінує свободу рухів. Вільний крій створює розслаблений силует, а щільна бавовна дарує відчуття затишку. Глибокий капюшон захистить від вітру, а кишеня-кенгуру робить його ідеальним.',
      gender: 'unisex',
      characteristics: [
        'Матеріал: щільна бавовна преміум-якості',
        'Крій: вільний',
        'Деталі: глибокий капюшон, кишеня-кенгуру',
        'Стиль: повсякденний, урбаністичний',
      ],
      quantity: 2,
    },
    {
      price: {
        value: 2400,
        currency: 'грн',
      },
      _id: '6877b9f116ae59c7b60d0092',
      name: "Футболка 'Metro Tee'",
      category: {
        _id: '690c9ce6a6276289c98fc00c',
        name: 'Худі та кофти',
      },
      image: 'https://ftp.goit.study/img/goods/6877b9f116ae59c7b60d0092.webp',
      size: ['XS', 'S', 'M', 'L', 'XL', 'XXL'],
      description:
        "Футболка 'Metro Tee' — це ваш особистий простір комфорту в динамічному ритмі міста. Створене для тих, хто цінує свободу рухів та лаконічний дизайн. Його вільний крій створює розслаблений силует, а щільна бавовна преміум-якості дарує неперевершене відчуття затишку та тепла. Це універсальна річ, що стане основою вашого повсякденного гардероба. Глибокий капюшон захистить від вітру, а зручна кишеня-кенгуру робить його ідеальним супутником для будь-яких справ.",
      feedbacks: [
        {
          _id: '690db0d01c0c1b016d8e010e',
          author: 'Тарас',
          date: '2025-02-28T00:00:00.000Z',
          description:
            "Хоча назва 'Tee', це повноцінне худі. І воно чудове! Бавовна преміум-якості, дуже щільна і м'яка. Капюшон глибокий, сидить ідеально. Вартує своїх грошей.",
          rate: 5,
          productId: '6877b9f116ae59c7b60d0092',
        },
        {
          _id: '690db0d01c0c1b016d8e010f',
          author: 'Марина',
          date: '2025-03-14T00:00:00.000Z',
          description:
            'Це просто любов! Таке затишне і стильне. Вільний крій – те, що треба. Якість тканини відчувається одразу. Дуже задоволена.',
          rate: 5,
          productId: '6877b9f116ae59c7b60d0092',
        },
        {
          _id: '690db0d01c0c1b016d8e0110',
          author: 'Олександр',
          date: '2025-04-01T00:00:00.000Z',
          description:
            "Мене збила з пантелику назва 'Футболка', але в описі все чітко. Це худі. Дуже якісне. Ношу XS, сидить вільно, але не мішком. Рекомендую.",
          rate: 4.5,
          productId: '6877b9f116ae59c7b60d0092',
        },
      ],
      prevDescription:
        "Відчуйте комфорт у динаміці міста з 'Metro Tee'. Це не просто одяг, а ваш особистий простір. Вільний крій, щільна бавовна преміум-якості, глибокий капюшон та кишеня-кенгуру роблять цю річ ідеальною для повсякденного гардероба.",
      gender: 'unisex',
      characteristics: [
        'Матеріал: Щільна бавовна (преміум-якість)',
        'Крій: Вільний (Relaxed fit)',
        'Особливості: Глибокий капюшон, кишеня-кенгуру',
        'Сезон: Всесезонний',
      ],
      quantity: 1,
    },
    {
      price: {
        value: 2600,
        currency: 'грн',
      },
      _id: '6877b9f116ae59c7b60d0093',
      name: "Штани 'Breeze Trousers'",
      category: {
        _id: '690c9ce6a6276289c98fc007',
        name: 'Штани та джинси',
      },
      image: 'https://ftp.goit.study/img/goods/6877b9f116ae59c7b60d0093.webp',
      size: ['XS', 'S', 'M', 'L', 'XL', 'XXL'],
      description:
        "Штани ʼBreeze Trousers' — це ваш особистий простір комфорту в динамічному ритмі міста. Створене для тих, хто цінує свободу рухів та лаконічний дизайн. Його вільний крій створює розслаблений силует, а щільна бавовна преміум-якості дарує неперевершене відчуття затишку та тепла. Це універсальна річ, що стане основою вашого повсякденного гардероба. Глибокий капюшон захистить від вітру, а зручна кишеня-кенгуру робить його ідеальним супутником для будь-яких справ.",
      feedbacks: [],
      prevDescription:
        'Штани ʼBreeze Trousersʼ — це простір комфорту в динамічному ритмі міста. Створені для тих, хто цінує свободу рухів та лаконічний дизайн. Вільний крій створює розслаблений силует, а щільна бавовна преміум-якості дарує відчуття затишку та тепла. Універсальна річ.',
      gender: 'unisex',
      characteristics: [
        'Матеріал: преміум-бавовна',
        'Крій: вільний, розслаблений силует',
        'Стиль: повсякденний, лаконічний дизайн',
      ],
      quantity: 1,
    },
  ],
  total: { value: 14000, currency: 'грн' },
});
